particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    BleConnection_t* fetchConnection(uint16_t connHandle);
    BleConnection_t* fetchConnection(const hal_ble_addr_t* address);
    void addConnection(const BleConnection_t& connection);
    void removeConnection(uint16_t connHandle);
    void initiateConnParamsUpdateIfNeeded(const BleConnection_t* connection);
    bool isConnParamsFeeded(const hal_ble_conn_params_t* params) const;
    static void toPlatformConnParams(ble_gap_conn_params_t* params, const hal_ble_conn_params_t* halConnParams);
    static void toHalConnParams(hal_ble_conn_params_t* halConnParams, const ble_gap_conn_params_t* params);
    static void onConnParamsUpdateTimerExpired(os_timer_t timer);
    static void processConnectionEvents(const ble_evt_t* event, void* context);
};

class BleObject::GattServer : public GattBase {
public:
    GattServer(BleObject* obj);
    ~GattServer() = default;
    int init(void);
    int addService(uint8_t type, const hal_ble_uuid_t* uuid, uint16_t* handle);
    int addCharacteristic(uint16_t svcHandle, uint8_t properties, const hal_ble_uuid_t* uuid, const char* desc, hal_ble_char_handles_t* handles);
    int addDescriptor(uint16_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, uint16_t len, uint16_t* handle);
    size_t setValue(uint16_t handle, const uint8_t* buf, size_t len);
    size_t getValue(uint16_t handle, uint8_t* buf, size_t len);

private:
    class BleCharacteristic {
        public:
            uint8_t properties;
            uint16_t svcHandle;
            hal_ble_char_handles_t handles;
            Vector<uint16_t> cccdConnections;
    };

    static const uint32_t BLE_HVX_PROCEDURE_TIMEOUT_MS = 5000;

    os_semaphore_t hvxSemaphore_;                   /**< Semaphore to wait until the HVX operation completed. */
    Vector<uint16_t> services_;                     /**< Added services. */
    Vector<BleCharacteristic> characteristics_;     /**< Added characteristic. */
    BleObject* bleObj_;                             /**< Pointer to the BLE Object. */
    AtomicAllocedPool charValuePool_;               /**< Pool to allocate memory for characteristic value. */
    AtomicAllocedPool gattsDataRecPool_;            /**< Pool to allocate memory for received data. */

    static const uint16_t GATT_SERVER_DATA_REC_POOL_SIZE = 1024;

    bool findService(uint16_t handle) const;
    BleCharacteristic* findCharacteristic(uint16_t handle);
    void addToCCCDList(BleCharacteristic* characteristic, uint16_t connHandle);
    void removeFromCCCDList(BleCharacteristic* characteristic, uint16_t connHandle);
    void removeFromAllCCCDList(uint16_t connHandle);
    static void gattsEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattServerEvents(const ble_evt_t* event, void* context);
};

class BleObject::GattClient : public GattBase {
public:
    GattClient(BleObject* obj);
    ~GattClient() = default;
    int init(void);
    bool discovering(void) const;
    int discoverServices(uint16_t connHandle, const hal_ble_uuid_t* uuid, on_ble_disc_service_cb_t callback, void* context);
    int discoverCharacteristics(uint16_t connHandle, const hal_ble_svc_t* service, on_ble_disc_char_cb_t callback, void* context);
    int setDesiredAttMtu(uint16_t attMtu);
    size_t writeAttribute(uint16_t connHandle, uint16_t attrHandle, const uint8_t* buf, size_t len, bool response);
    size_t readAttribute(uint16_t connHandle, uint16_t attrHandle, uint8_t* buf, size_t len);

private:
    enum {
        BLE_DISCOVERY_PROCEDURE_IDLE,
        BLE_DISCOVERY_PROCEDURE_SERVICES,
        BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS,
        BLE_DISCOVERY_PROCEDURE_DESCRIPTORS,
    };

    uint8_t discoverAll_ : 1;                           /**< If it is going to discover all service during the service discovery procedure. */
    uint8_t isDiscovering_ : 1;                         /**< If there is on-going discovery procedure. */
    uint16_t currDiscConnHandle_;                       /**< Current connection handle under which the service and characteristics to be discovered. */
    uint8_t currDiscProcedure_;                         /**< Current discovery procedure. */
    hal_ble_svc_t currDiscSvc_;                         /**< Current service to be discovered for the characteristics. */
    os_semaphore_t discoverySemaphore_;                 /**< Semaphore to wait until the discovery procedure completed. */
    os_semaphore_t readWriteSemaphore_;                 /**< Semaphore to wait until the read or write operation completed. */
    Vector<hal_ble_svc_t> discoveredServices_;          /**< Discover services. */
    Vector<hal_ble_char_t> discoveredCharacteristics_;  /**< Discovered characteristics. */
    uint16_t readAttrHandle_;                           /**< Current handle of which attribute to be read. */
    uint8_t* readBuf_;                                  /**< Current buffer to be filled for the read data. */
    uint16_t readLen_;                                  /**< Length of read data. */
    BleObject* bleObj_;                                 /**< Pointer to the BLE Object. */
    AtomicAllocedPool gattcDiscSvcCharPool_;            /**< Pool to allocate memory for discovered services or characteristics. */
    AtomicAllocedPool gattcDataRecPool_;                /**< Pool to allocate memory for received data. */
    uint16_t attMtuExchangeConnHandle_;                 /**< Current handle of the connection to execute ATT_MTU exchange procedure. */
    os_timer_t attMtuExchangeTimer_;                    /**< Timer used for sending the exchanging ATT_MTU request after connection established. */

    static const uint16_t SERVICES_BASE_START_HANDLE = 0x0001;
    static const uint16_t SERVICES_TOP_END_HANDLE = 0xFFFF;
    static const uint32_t BLE_DICOVERY_PROCEDURE_TIMEOUT_MS = 10000;
    static const uint32_t BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS = 5000;
    static const uint16_t GATT_CLIENT_DISC_SVC_CHAR_POOL_SIZE = 2048;
    static const uint16_t GATT_CLIENT_DATA_REC_POOL_SIZE = 1024;
    static const uint32_t BLE_ATT_MTU_EXCHANGE_DELAY_MS = 800;

