particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    void resetDiscoveryState(void);
    bool readServiceUUID128IfNeeded(void);
    bool readCharacteristicUUID128IfNeeded(void);
    hal_ble_svc_t* findDiscoveredService(uint16_t handle);
    hal_ble_char_t* findDiscoveredCharacteristic(uint16_t handle);
    static void onAttMtuExchangeTimerExpired(os_timer_t timer);
    static void gattcEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattClientEvents(const ble_evt_t* event, void* context);
};

BleObject::BleEventDispatcher::BleEventDispatcher(BleObject* obj) : bleObj_(obj ){
    evtQueue_ = nullptr;
    evtThread_ = nullptr;
}

int BleObject::BleEventDispatcher::init(void) {
    if (os_queue_create(&evtQueue_, sizeof(EventMessage), BLE_EVENT_QUEUE_ITEM_COUNT, nullptr)) {
        LOG(ERROR, "os_queue_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    if (os_thread_create(&evtThread_, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, bleEventDispatch, this, BLE_EVENT_THREAD_STACK_SIZE)) {
        LOG(ERROR, "os_thread_create() failed");
        os_queue_destroy(evtQueue_, nullptr);
        return SYSTEM_ERROR_INTERNAL;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleEventDispatcher::enqueue(EventMessage& msg) {
    if (os_queue_put(evtQueue_, &msg, 0, nullptr)) {
        LOG(ERROR, "os_queue_put() failed.");
        // Free the memory if needed.
        if (msg.hook && msg.hookContext) {
            msg.hook(&msg.evt, msg.hookContext);
        }
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

os_thread_return_t BleObject::BleEventDispatcher::bleEventDispatch(void* param) {
    BleEventDispatcher* dispatcher = static_cast<BleEventDispatcher*>(param);
    while (1) {
        EventMessage msg;
        if (!os_queue_take(dispatcher->evtQueue_, &msg, CONCURRENT_WAIT_FOREVER, nullptr)) {
            if (msg.handler && msg.context) {
                // Invoke the handler registered by specific application.
                if (msg.evt.type == BLE_EVT_SCAN_RESULT) {
                    msg.handler(&msg.evt.params.scan_result, msg.context);
                } else if (msg.evt.type == BLE_EVT_SVC_DISCOVERED) {
                    msg.handler(&msg.evt.params.svc_disc, msg.context);
                } else if (msg.evt.type == BLE_EVT_CHAR_DISCOVERED) {
                    msg.handler(&msg.evt.params.char_disc, msg.context);
                } else if (msg.evt.type == BLE_EVT_GATT_PARAMS_UPDATED) {
                    msg.handler(&msg.evt.params.gatt_params_updated, msg.context);
                }
            } else {
                // Just dispatch the event to the application those have subscribe the generic events.
                for (int i = 0; i < dispatcher->bleObj_->genericEventHandlers_.size(); i++) {
                    BleGenericEventHandler& evtHandler = dispatcher->bleObj_->genericEventHandlers_[i];
                    if (evtHandler.handler && evtHandler.context) {
                        evtHandler.handler(&msg.evt, evtHandler.context);
                    }
                }
            }
            // Free the memory if needed.
            if (msg.hook && msg.hookContext) {
                msg.hook(&msg.evt, msg.hookContext);
            }
        } else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }
    os_thread_exit(dispatcher->evtThread_);
}

typedef struct {
    BleObject::BleGap* instance;
} BleGapImpl;
static BleGapImpl bleGapImpl;

BleObject::BleGap::BleGap(BleObject* obj) : bleObj_(obj) {
}

int BleObject::BleGap::init(void) {
    // Set the default device name
    char devName[32] = {};
    get_device_name(devName, sizeof(devName));
    setDeviceName((const uint8_t*)devName, strlen(devName));
    bleGapImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGap, 1, processBleGapEvents, &bleGapImpl);
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceName(const uint8_t* deviceName, uint16_t len) {
    if (deviceName == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_conn_sec_mode_t secMode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);
    int ret = sd_ble_gap_device_name_set(&secMode, deviceName, len);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_device_name_set");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::getDeviceName(uint8_t* deviceName, uint16_t* len) {
    if (deviceName == nullptr || len == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    // non NULL-terminated string returned.
    int ret = sd_ble_gap_device_name_get(deviceName, len);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_device_name_get");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceAddress(const hal_ble_addr_t* address) {
    if (bleObj_->broadcaster->advertising() ||
            bleObj_->observer->scanning() ||
            bleObj_->connectionsMgr->connecting()) {
        // The identity address cannot be changed while advertising, scanning or creating a connection.
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (address == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (address->addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && address->addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_addr_t localAddr;
    localAddr.addr_id_peer = false;
    localAddr.addr_type = address->addr_type;
    memcpy(localAddr.addr, address->addr, BLE_SIG_ADDR_LEN);
    int ret = sd_ble_gap_addr_set(&localAddr);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_addr_set");
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::getDeviceAddress(hal_ble_addr_t* address) {
    if (address == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_addr_t localAddr;
    int ret = sd_ble_gap_addr_get(&localAddr);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_addr_get");
    address->addr_type = localAddr.addr_type;
    memcpy(address->addr, localAddr.addr, BLE_SIG_ADDR_LEN);
    return SYSTEM_ERROR_NONE;
}

