particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::Broadcaster::advertising(void) const {
    return isAdvertising_;
}

int BleObject::Broadcaster::setAdvertisingParams(const hal_ble_adv_params_t* params) {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    int ret = suspend();
    CHECK_RETURN(ret, nullptr);
    ret = configure(params);
    NRF_CHECK_RETURN(ret, nullptr);
    memcpy(&advParams_, params, sizeof(hal_ble_adv_params_t));
    return resume();
}

int BleObject::Broadcaster::getAdvertisingParams(hal_ble_adv_params_t* params) const {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(params, &advParams_, sizeof(hal_ble_adv_params_t));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::setAdvertisingData(const uint8_t* buf, size_t len) {
    // It is invalid to provide the same data buffers while advertising.
    int ret = suspend();
    CHECK_RETURN(ret, nullptr);
    if (buf != nullptr) {
        len = MIN(len, BLE_MAX_ADV_DATA_LEN);
        memcpy(advData_, buf, len);
    } else {
        // It should at least contain the Flags in advertising data.
        len = 3;
    }
    advDataLen_ = len;
    ret = configure(nullptr);
    CHECK_RETURN(ret, nullptr);
    return resume();
}

size_t BleObject::Broadcaster::getAdvertisingData(uint8_t* buf, size_t len) const {
    if (buf == nullptr) {
        return 0;
    }
    len = MIN(len, advDataLen_);
    memcpy(buf, advData_, len);
    return len;
}

int BleObject::Broadcaster::setScanResponseData(const uint8_t* buf, size_t len) {
    // It is invalid to provide the same data buffers while advertising.
    int ret = suspend();
    CHECK_RETURN(ret, nullptr);
    if (buf != nullptr) {
        len = MIN(len, BLE_MAX_ADV_DATA_LEN);
        memcpy(scanRespData_, buf, len);
    } else {
        len = 0;
    }
    scanRespDataLen_ = len;
    ret = configure(nullptr);
    CHECK_RETURN(ret, nullptr);
    return resume();
}

size_t BleObject::Broadcaster::getScanResponseData(uint8_t* buf, size_t len) const {
    if (buf == nullptr) {
        return 0;
    }
    len = MIN(len, scanRespDataLen_);
    memcpy(buf, scanRespData_, len);
    return len;
}

int BleObject::Broadcaster::setTxPower(int8_t val) {
    int ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, advHandle_, roundTxPower(val));
    NRF_CHECK_RETURN(ret, "sd_ble_gap_tx_power_set");
    return SYSTEM_ERROR_NONE;
}

int8_t BleObject::Broadcaster::getTxPower(void) const {
    return txPower_;
}

int BleObject::Broadcaster::startAdvertising(void) {
    int ret;
    if (isAdvertising_) {
        // Stop advertising first.
        ret = sd_ble_gap_adv_stop(advHandle_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_stop");
        isAdvertising_ = false;
    }
    ret = sd_ble_gap_adv_start(advHandle_, BLE_CONN_CFG_TAG);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_start");
    isAdvertising_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::stopAdvertising(void) {
    if (isAdvertising_) {
        int ret = sd_ble_gap_adv_stop(advHandle_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_stop");
        isAdvertising_ = false;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::suspend(void) {
    if (isAdvertising_) {
        int ret = ble_gap_stop_advertising();
        CHECK_RETURN(ret, "ble_gap_stop_advertising");
        advPending_ = true;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::Broadcaster::resume(void) {
    if (advPending_) {
        int ret = startAdvertising();
        CHECK_RETURN(ret, nullptr);
        advPending_ = false;
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::Broadcaster::toPlatformAdvParams(ble_gap_adv_params_t* params, const hal_ble_adv_params_t* halParams) {
    memset(params, 0x00, sizeof(ble_gap_adv_params_t));
    params->properties.type = halParams->type;
    params->properties.include_tx_power = false; // FIXME: for extended advertising packet
    params->p_peer_addr = nullptr;
    params->interval = halParams->interval;
    params->duration = halParams->timeout;
    params->filter_policy = halParams->filter_policy;
    params->primary_phy = BLE_GAP_PHY_1MBPS;
}

void BleObject::Broadcaster::toPlatformAdvData(ble_gap_adv_data_t* data) {
    data->adv_data.p_data = advData_;
    data->adv_data.len = advDataLen_;
    data->scan_rsp_data.p_data = scanRespData_;
    data->scan_rsp_data.len = scanRespDataLen_;
}

int BleObject::Broadcaster::configure(const hal_ble_adv_params_t* params) {
    int ret;
    ble_gap_adv_data_t bleGapAdvData;
    toPlatformAdvData(&bleGapAdvData);
    if (params == nullptr) {
        ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, nullptr);
    } else {
        ble_gap_adv_params_t bleGapAdvParams;
        toPlatformAdvParams(&bleGapAdvParams, params);
        LOG_DEBUG(TRACE, "BLE advertising interval: %.3fms, timeout: %dms.",
                  bleGapAdvParams.interval*0.625, bleGapAdvParams.duration*10);
        ret = sd_ble_gap_adv_set_configure(&advHandle_, &bleGapAdvData, &bleGapAdvParams);
    }
    NRF_CHECK_RETURN(ret, "sd_ble_gap_adv_set_configure");
    return SYSTEM_ERROR_NONE;
}

int8_t BleObject::Broadcaster::roundTxPower(int8_t value) {
    uint8_t i = 0;
    for (i = 0; i < sizeof(validTxPower_); i++) {
        if (value == validTxPower_[i]) {
            return value;
        } else {
            if (value < validTxPower_[i]) {
                return validTxPower_[i];
            }
        }
    }
    return validTxPower_[i - 1];
}

void BleObject::Broadcaster::processBroadcasterEvents(const ble_evt_t* event, void* context) {
    Broadcaster* broadcaster = static_cast<BroadcasterImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            broadcaster->isAdvertising_ = false;
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_ADV_STOPPED;
            msg.evt.params.adv_stopped.version = 0x01;
            msg.evt.params.adv_stopped.reserved = nullptr;
            broadcaster->bleObj_->dispatcher->enqueue(msg);
        } break;
        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            broadcaster->isAdvertising_ = false;
            if (event->evt.gap_evt.params.connected.role == BLE_ROLE_PERIPHERAL) {
                broadcaster->connHandle_ = event->evt.gap_evt.conn_handle;
            }
        } break;
        case BLE_GAP_EVT_DISCONNECTED: {
            // Re-start advertising.
            // FIXME: when multi-role implemented.
            if (broadcaster->connHandle_ == event->evt.gap_evt.conn_handle) {
                LOG_DEBUG(TRACE, "Restart BLE advertising.");
                int ret = broadcaster->startAdvertising();
                CHECK_RETURN_VOID(ret, nullptr);
                broadcaster->connHandle_ = BLE_INVALID_CONN_HANDLE;
            }
        } break;
        default: break;
    }
}

const int8_t BleObject::Broadcaster::validTxPower_[8] = { -20, -16, -12, -8, -4, 0, 4, 8 };

