particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
typedef struct {
    BleObject::Observer* instance;
} ObserverImpl;
static ObserverImpl observerImpl;

BleObject::Observer::Observer(BleObject* obj) : bleObj_(obj) {
    isScanning_ = false;
    scanParams_.version = 0x01;
    scanParams_.active = true;
    scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
    scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
    scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
    scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;
    scanSemaphore_ = nullptr;
    bleScanData_.p_data = scanReportBuff_;
    bleScanData_.len = sizeof(scanReportBuff_);
    scanResultCallBack_ = nullptr;
    context_ = nullptr;
}

int BleObject::Observer::init(void) {
    observerScannedDataPool_.init(OBSERVER_SCANNED_DATA_POOL_SIZE);
    observerImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleObserver, 1, processObserverEvents, &observerImpl);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::Observer::scanning(void) {
    return isScanning_;
}

int BleObject::Observer::setScanParams(const hal_ble_scan_params_t* params) {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((params->interval < BLE_GAP_SCAN_INTERVAL_MIN) ||
            (params->interval > BLE_GAP_SCAN_INTERVAL_MAX) ||
            (params->window < BLE_GAP_SCAN_WINDOW_MIN) ||
            (params->window > BLE_GAP_SCAN_WINDOW_MAX) ||
            (params->window > params->interval) ) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(&scanParams_, params, sizeof(hal_ble_scan_params_t));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::getScanParams(hal_ble_scan_params_t* params) const {
    if (params == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    memcpy(params, &scanParams_, sizeof(hal_ble_scan_params_t));
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::continueScanning(void) {
    int ret = sd_ble_gap_scan_start(nullptr, &bleScanData_);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
    return SYSTEM_ERROR_NONE;
}

int BleObject::Observer::startScanning(on_ble_scan_result_cb_t callback, void* context) {
    if (isScanning_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&scanSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    ble_gap_scan_params_t bleGapScanParams;
    toPlatformScanParams(&bleGapScanParams);
    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625, bleGapScanParams.window*0.625, bleGapScanParams.timeout*10);
    cache_.clear();
    scanResultCallBack_ = callback;
    context_ = context;
    int ret = sd_ble_gap_scan_start(&bleGapScanParams, &bleScanData_);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
    isScanning_ = true;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(scanSemaphore_, CONCURRENT_WAIT_FOREVER, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(scanSemaphore_);
    isScanning_ = false;
    return ret;
}

int BleObject::Observer::stopScanning(void) {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    int ret = sd_ble_gap_scan_stop();
    NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_stop");
    os_semaphore_give(scanSemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

void BleObject::Observer::toPlatformScanParams(ble_gap_scan_params_t* params) const {
    memset(params, 0x00, sizeof(ble_gap_scan_params_t));
    params->extended = 0;
    params->active = scanParams_.active;
    params->interval = scanParams_.interval;
    params->window = scanParams_.window;
    params->timeout = scanParams_.timeout;
    params->scan_phys = BLE_GAP_PHY_1MBPS;
    params->filter_policy = scanParams_.filter_policy;
}

bool BleObject::Observer::chacheDevice(const hal_ble_addr_t& newAddr) {
    for (int i = 0; i < cache_.size(); i++) {
        const hal_ble_addr_t& existAddr = cache_[i];
        if (existAddr.addr_type == newAddr.addr_type &&
                !memcmp(existAddr.addr, newAddr.addr, BLE_SIG_ADDR_LEN)) {
            LOG_DEBUG(TRACE, "Duplicated scan result. Filter it out.");
            return false;
        }
    }
    cache_.append(newAddr);
    return true;
}

void BleObject::Observer::observerEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    Observer* observer = static_cast<Observer*>(context);
    if (observer && event && event->type == BLE_EVT_SCAN_RESULT) {
        if (event->params.scan_result.data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.data);
            LOG_DEBUG(TRACE, "Free Scanned data memory: %u", (unsigned)event->params.scan_result.data);
        }
    }
}

void BleObject::Observer::processObserverEvents(const ble_evt_t* event, void* context) {
    Observer* observer = static_cast<ObserverImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_REPORT: {
            const ble_gap_evt_adv_report_t& advReport = event->evt.gap_evt.params.adv_report;
            LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");
            hal_ble_addr_t newAddr;
            newAddr.addr_type = advReport.peer_addr.addr_type;
            memcpy(newAddr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
            if (observer->chacheDevice(newAddr)) {
                // The new scanned device is not in the cached device list.
                uint8_t* data = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                LOG_DEBUG(TRACE, "Scanned data address: %u, len: %u", (unsigned)data, advReport.data.len);
                if (data) {
                    BleObject::BleEventDispatcher::EventMessage msg;
                    msg.evt.type = BLE_EVT_SCAN_RESULT;
                    msg.evt.params.scan_result.version = 0x01;
                    msg.evt.params.scan_result.type.connectable = advReport.type.connectable;
                    msg.evt.params.scan_result.type.scannable = advReport.type.scannable;
                    msg.evt.params.scan_result.type.directed = advReport.type.directed;
                    msg.evt.params.scan_result.type.scan_response = advReport.type.scan_response;
                    msg.evt.params.scan_result.type.extended_pdu = advReport.type.extended_pdu;
                    msg.evt.params.scan_result.rssi = advReport.rssi;
                    msg.evt.params.scan_result.peer_addr.addr_type = newAddr.addr_type;
                    memcpy(msg.evt.params.scan_result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                    msg.evt.params.scan_result.data_len = advReport.data.len;
                    memcpy(data, advReport.data.p_data, advReport.data.len);
                    msg.evt.params.scan_result.data = data;
                    msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                    msg.context = observer->context_;
                    msg.hook = observer->observerEventProcessedHook;
                    msg.hookContext = observer;
                    observer->bleObj_->dispatcher->enqueue(msg);
                }
            }
            // Continue scanning
            observer->continueScanning();
        } break;
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                os_semaphore_give(observer->scanSemaphore_, false);
            }
        } break;
        default: break;
    }
}

