particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
typedef struct {
    BleObject::ConnectionsManager* instance;
} ConnectionsManagerImpl;
static ConnectionsManagerImpl connMgrImpl;

BleObject::ConnectionsManager::ConnectionsManager(BleObject* obj) : bleObj_(obj) {
    isConnecting_ = 0;
    memset(&connectingAddr_, 0x00, sizeof(hal_ble_addr_t));
    connParamsUpdateAttempts_ = 0;
    disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    connectSemaphore_ = nullptr;
    disconnectSemaphore_ = nullptr;
    connParamsUpdateSemaphore_ = nullptr;
    connParamsUpdateTimer_ = nullptr;
}

int BleObject::ConnectionsManager::init(void) {
    /*
     * Default Peripheral Preferred Connection Parameters.
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    ble_gap_conn_params_t bleGapConnParams;
    bleGapConnParams.min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL;
    bleGapConnParams.max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL;
    bleGapConnParams.slave_latency = BLE_DEFAULT_SLAVE_LATENCY;
    bleGapConnParams.conn_sup_timeout = BLE_DEFAULT_CONN_SUP_TIMEOUT;
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_ppcp_set");
    if (os_timer_create(&connParamsUpdateTimer_, BLE_CONN_PARAMS_UPDATE_DELAY_MS, onConnParamsUpdateTimerExpired, this, true, nullptr)) {
        LOG(ERROR, "os_timer_create() failed.");
        return SYSTEM_ERROR_INTERNAL;
    }
    connMgrImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleConnectionManager, 1, processConnectionEvents, &connMgrImpl);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::setPPCP(const hal_ble_conn_params_t* ppcp) {
    if (ppcp == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE) &&
            (ppcp->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN ||
             ppcp->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE) &&
            (ppcp->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN ||
             ppcp->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (ppcp->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if ((ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE) &&
            (ppcp->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN ||
             ppcp->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_conn_params_t bleGapConnParams;
    toPlatformConnParams(&bleGapConnParams, ppcp);
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_set");
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getPPCP(hal_ble_conn_params_t* ppcp) const {
    if (ppcp == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_conn_params_t bleGapConnParams;
    int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
    toHalConnParams(ppcp, &bleGapConnParams);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::connecting(void) const {
    return isConnecting_;
}

bool BleObject::ConnectionsManager::connected(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        return connections_.size() > 0;
    } else if (fetchConnection(address)) {
        return true;
    }
    return false;
}

int BleObject::ConnectionsManager::connect(const hal_ble_addr_t* address) {
    // Stop scanning first to give the scanning semaphore if possible.
    int ret = bleObj_->observer->stopScanning();
    CHECK_RETURN(ret, nullptr);
    if (os_semaphore_create(&connectSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    ble_gap_addr_t bleDevAddr;
    ble_gap_scan_params_t bleGapScanParams;
    ble_gap_conn_params_t bleGapConnParams;
    memset(&bleDevAddr, 0x00, sizeof(ble_gap_addr_t));
    bleDevAddr.addr_type = address->addr_type;
    memcpy(bleDevAddr.addr, address->addr, BLE_SIG_ADDR_LEN);
    bleObj_->observer->toPlatformScanParams(&bleGapScanParams);
    ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
    ret = sd_ble_gap_connect(&bleDevAddr, &bleGapScanParams, &bleGapConnParams, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        os_semaphore_destroy(connectSemaphore_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_connect");
    }
    isConnecting_ = true;
    memcpy(&connectingAddr_, address, sizeof(hal_ble_addr_t));
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(connectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(connectSemaphore_);
    isConnecting_ = false;
    memset(&connectingAddr_, 0x00, sizeof(hal_ble_addr_t));
    return ret;
}

int BleObject::ConnectionsManager::connectCancel(void) {
    if (isConnecting_) {
        int ret = sd_ble_gap_connect_cancel();
        NRF_CHECK_RETURN(ret, "sd_ble_gap_connect_cancel");
        isConnecting_ = false;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::disconnect(uint16_t connHandle) {
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&disconnectSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        os_semaphore_destroy(disconnectSemaphore_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_disconnect");
    }
    disconnectingHandle_ = connHandle;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(disconnectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(disconnectSemaphore_);
    disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    return ret;
}

int BleObject::ConnectionsManager::updateConnectionParams(uint16_t connHandle, const hal_ble_conn_params_t* params) {
    int ret;
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&connParamsUpdateSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    ble_gap_conn_params_t bleGapConnParams;
    if (params == nullptr) {
        // Use the PPCP characteristic value as the connection parameters.
        ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_ppcp_get");
    }
    // For Central role, this will initiate the connection parameter update procedure.
    // For Peripheral role, this will use the passed in parameters and send the request to central.
    ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
    if (ret != NRF_SUCCESS) {
        os_semaphore_destroy(connParamsUpdateSemaphore_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_conn_param_update");
    }
    connParamUpdateHandle_ = connHandle;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(connParamsUpdateSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(connParamsUpdateSemaphore_);
    connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    return ret;
}

int BleObject::ConnectionsManager::getConnectionParams(uint16_t connHandle, hal_ble_conn_params_t* params) {
    BleConnection_t* connection = fetchConnection(connHandle);
    if (connection == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    memcpy(params, &connection->effectiveConnParams, sizeof(hal_ble_conn_params_t));
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::valid(uint16_t connHandle) const {
    if (connHandle == BLE_INVALID_CONN_HANDLE) {
        return false;
    }
    for (int i = 0; i < connections_.size(); i++) {
        const BleConnection_t& connection = connections_[i];
        if (connection.connHandle == connHandle) {
            return true;
        }
    }
    return false;
}

void BleObject::ConnectionsManager::toPlatformConnParams(ble_gap_conn_params_t* params, const hal_ble_conn_params_t* halConnParams) {
    memset(params, 0x00, sizeof(ble_gap_conn_params_t));
    params->min_conn_interval = halConnParams->min_conn_interval;
    params->max_conn_interval = halConnParams->max_conn_interval;
    params->slave_latency = halConnParams->slave_latency;
    params->conn_sup_timeout = halConnParams->conn_sup_timeout;
}

void BleObject::ConnectionsManager::toHalConnParams(hal_ble_conn_params_t* halConnParams, const ble_gap_conn_params_t* params) {
    memset(halConnParams, 0x00, sizeof(hal_ble_conn_params_t));
    halConnParams->min_conn_interval = params->min_conn_interval;
    halConnParams->max_conn_interval = params->max_conn_interval;
    halConnParams->slave_latency = params->slave_latency;
    halConnParams->conn_sup_timeout = params->conn_sup_timeout;
}

BleObject::ConnectionsManager::BleConnection_t* BleObject::ConnectionsManager::fetchConnection(uint16_t connHandle) {
    if (connHandle == BLE_INVALID_CONN_HANDLE) {
        return nullptr;
    }
    for (int i = 0; i < connections_.size(); i++) {
        BleConnection_t& connection = connections_.at(i);
        if (connection.connHandle == connHandle) {
            return &connection;
        }
    }
    return nullptr;
}

BleObject::ConnectionsManager::BleConnection_t* BleObject::ConnectionsManager::fetchConnection(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        return nullptr;
    }
    for (int i = 0; i < connections_.size(); i++) {
        BleConnection_t& connection = connections_.at(i);
        hal_ble_addr_t& peer = connection.peer;
        if (peer.addr_type == address->addr_type && !memcmp(peer.addr, address->addr, BLE_SIG_ADDR_LEN)) {
            return &connection;
        }
    }
    return nullptr;
}

void BleObject::ConnectionsManager::addConnection(const BleConnection_t& connection) {
    removeConnection(connection.connHandle);
    connections_.append(connection);
}

void BleObject::ConnectionsManager::removeConnection(uint16_t connHandle) {
    for (int i = 0; i < connections_.size(); i++) {
        const BleConnection_t& connection = connections_[i];
        if (connection.connHandle == connHandle) {
            connections_.removeAt(i);
        }
    }
}

void BleObject::ConnectionsManager::initiateConnParamsUpdateIfNeeded(const BleConnection_t* connection) {
    if (connParamsUpdateTimer_ == nullptr) {
        return;
    }
    if (!isConnParamsFeeded(&connection->effectiveConnParams)) {
        if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                        connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
                connParamUpdateHandle_ = connection->connHandle;
                return;
            }
        } else {
            int ret = sd_ble_gap_disconnect(connection->connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_disconnect");
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

bool BleObject::ConnectionsManager::isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
    hal_ble_conn_params_t ppcp;
    if (getPPCP(&ppcp) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
        if (params->max_conn_interval < ppcp.min_conn_interval ||
                params->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (params->slave_latency < minAcceptedSl ||
                params->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (params->conn_sup_timeout < minAcceptedTo ||
                params->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }
    return true;
}

void BleObject::ConnectionsManager::onConnParamsUpdateTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->connParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
        return;
    }
    // For Peripheral, it will use the PPCP characteristic value.
    int ret = sd_ble_gap_conn_param_update(connMgr->connParamUpdateHandle_, nullptr);
    if (ret != NRF_SUCCESS) {
        sd_ble_gap_disconnect(connMgr->connParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        NRF_CHECK_RETURN_VOID(ret, "sd_ble_gap_conn_param_update");
    }
    connMgr->connParamsUpdateAttempts_++;
}

