particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
size_t BleObject::GattServer::setValue(uint16_t attrHandle, const uint8_t* buf, size_t len) {
    if (attrHandle == BLE_INVALID_ATTR_HANDLE || buf == nullptr) {
        return 0;
    }
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    if (characteristic != nullptr && attrHandle == characteristic->handles.value_handle) {
        len = MIN(len, BLE_MAX_ATTR_VALUE_PACKET_SIZE);
        ble_gatts_value_t gattValue;
        gattValue.len = len;
        gattValue.offset = 0;
        gattValue.p_value = (uint8_t*)buf;
        ret_code_t ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
            return 0;
        }
        // Notify or indicate the value if possible.
        if ((characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) || (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
            for (int i = 0; i < characteristic->cccdConnections.size(); i++) {
                if (os_semaphore_create(&hvxSemaphore_, 1, 0)) {
                    LOG(ERROR, "os_semaphore_create() failed");
                    break;
                }
                ble_gatts_hvx_params_t hvxParams;
                uint16_t hvxLen = MIN(len, BLE_ATTR_VALUE_PACKET_SIZE(getAttMtu(characteristic->cccdConnections[i])));
                LOG_DEBUG(TRACE, "Notify data len: %d", hvxLen);
                if (characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) {
                    hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
                } else if (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE) {
                    hvxParams.type = BLE_GATT_HVX_INDICATION;
                }
                hvxParams.handle = attrHandle;
                hvxParams.offset = 0;
                hvxParams.p_data = buf;
                hvxParams.p_len = &hvxLen;
                ret_code_t ret = sd_ble_gatts_hvx(characteristic->cccdConnections[i], &hvxParams);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
                    os_semaphore_destroy(hvxSemaphore_);
                    break;
                }
                if (os_semaphore_take(hvxSemaphore_, BLE_HVX_PROCEDURE_TIMEOUT_MS, false)) {
                    os_semaphore_destroy(hvxSemaphore_);
                    break;
                }
                os_semaphore_destroy(hvxSemaphore_);
            }
        }
        return len;
    }
    else {
        return 0;
    }
}

size_t BleObject::GattServer::getValue(uint16_t attrHandle, uint8_t* buf, size_t len) {
    if (attrHandle == BLE_INVALID_ATTR_HANDLE || buf == nullptr) {
        return 0;
    }
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    if (characteristic != nullptr && attrHandle == characteristic->handles.value_handle) {
        len = MIN(len, BLE_MAX_ATTR_VALUE_PACKET_SIZE);
        ble_gatts_value_t gattValue;
        gattValue.len = len;
        gattValue.offset = 0;
        gattValue.p_value = buf;
        int ret = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
            return 0;
        }
        return gattValue.len;
    } else {
        return 0;
    }
}

bool BleObject::GattServer::findService(uint16_t handle) const {
    for (int i = 0; i < services_.size(); i++) {
        const uint16_t& svcHandle = services_[i];
        if (svcHandle == handle) {
            return true;
        }
    }
    return false;
}

BleObject::GattServer::BleCharacteristic* BleObject::GattServer::findCharacteristic(uint16_t handle) {
    for (int i = 0; i < characteristics_.size(); i++) {
        BleCharacteristic& characteristic = characteristics_[i];
        if (characteristic.handles.value_handle == handle ||
                characteristic.handles.decl_handle == handle ||
                characteristic.handles.user_desc_handle == handle ||
                characteristic.handles.cccd_handle == handle ||
                characteristic.handles.sccd_handle == handle) {
            return &characteristic;
        }
    }
    return nullptr;
}

void BleObject::GattServer::addToCCCDList(BleCharacteristic* characteristic, uint16_t connHandle) {
    characteristic->cccdConnections.append(connHandle);
}

void BleObject::GattServer::removeFromCCCDList(BleCharacteristic* characteristic, uint16_t connHandle) {
    for (int i = 0; i < characteristic->cccdConnections.size(); i++) {
        uint16_t& handle = characteristic->cccdConnections[i];
        if (handle == connHandle) {
            characteristic->cccdConnections.removeAt(i);
        }
    }
}

void BleObject::GattServer::removeFromAllCCCDList(uint16_t connHandle) {
    for (int i = 0; i < characteristics_.size(); i++) {
        BleCharacteristic& characteristic = characteristics_[i];
        removeFromCCCDList(&characteristic, connHandle);
    }
}

void BleObject::GattServer::gattsEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    GattServer* gatts = static_cast<GattServer*>(context);
    if (gatts && event && event->type == BLE_EVT_DATA_WRITTEN) {
        if (event->params.data_rec.data != nullptr) {
            gatts->gattsDataRecPool_.free(event->params.data_rec.data);
            LOG_DEBUG(TRACE, "Free received data memory: %u", (unsigned)event->params.data_rec.data);
        }
    }
}

void BleObject::GattServer::processGattServerEvents(const ble_evt_t* event, void* context) {
    GattServer* gatts = static_cast<GattServerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            // Use the default ATT_MTU on connected.
            gatts->configureAttMtu(event->evt.gap_evt.conn_handle, BLE_DEFAULT_ATT_MTU_SIZE);
        } break;
        case BLE_GAP_EVT_DISCONNECTED: {
            gatts->clearAttMtu(event->evt.gap_evt.conn_handle);
            gatts->removeFromAllCCCDList(event->evt.gap_evt.conn_handle);
        } break;
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            const ble_gatts_evt_exchange_mtu_request_t& mtuRequest = event->evt.gatts_evt.params.exchange_mtu_request;
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request: %d, desired: %d", mtuRequest.client_rx_mtu, gatts->desiredAttMtu_);
            int ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, gatts->desiredAttMtu_);
            NRF_CHECK_RETURN_VOID(ret, "sd_ble_gatts_exchange_mtu_reply");
            uint16_t effectAttMtu = MIN(mtuRequest.client_rx_mtu, gatts->desiredAttMtu_);
            effectAttMtu = MAX(effectAttMtu, BLE_MIN_ATT_MTU_SIZE);
            gatts->configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu, true);
            LOG_DEBUG(TRACE, "Effective ATT MTU: %d.", effectAttMtu);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.evt.params.gatt_params_updated.version = 0x01;
            msg.evt.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.evt.params.gatt_params_updated.att_mtu_size = effectAttMtu;
            gatts->bleObj_->dispatcher->enqueue(msg);
        } break;
        case BLE_GATTS_EVT_WRITE: {
            const ble_gatts_evt_write_t& write = event->evt.gatts_evt.params.write;
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic, handle: %d", write.handle);
            BleCharacteristic* characteristic = gatts->findCharacteristic(write.handle);
            if (characteristic != nullptr) {
                if (characteristic->handles.cccd_handle == write.handle) {
                    if (event->evt.gatts_evt.params.write.data[0] > 0) {
                        gatts->addToCCCDList(characteristic, event->evt.gatts_evt.conn_handle);
                    } else {
                        gatts->removeFromCCCDList(characteristic, event->evt.gatts_evt.conn_handle);
                    }
                }
                // TODO: deal with different write commands.
                uint8_t* data = (uint8_t*)gatts->gattsDataRecPool_.alloc(write.len);
                LOG_DEBUG(TRACE, "Received data address: %u, len: %u", (unsigned)data, write.len);
                if (data) {
                    BleObject::BleEventDispatcher::EventMessage msg;
                    msg.evt.type = BLE_EVT_DATA_WRITTEN;
                    msg.evt.params.data_rec.version = 0x01;
                    msg.evt.params.data_rec.conn_handle = event->evt.gatts_evt.conn_handle;
                    msg.evt.params.data_rec.attr_handle = write.handle;
                    msg.evt.params.data_rec.offset = write.offset;
                    msg.evt.params.data_rec.data_len = write.len;
                    memcpy(data, write.data, write.len);
                    msg.evt.params.data_rec.data = data;
                    msg.hook = gatts->gattsEventProcessedHook;
                    msg.hookContext = gatts;
                    gatts->bleObj_->dispatcher->enqueue(msg);
                }
            }
        } break;
        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
            os_semaphore_give(gatts->hvxSemaphore_, false);
        } break;
        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            os_semaphore_give(gatts->hvxSemaphore_, false);
        } break;
        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);
            // Disconnect on GATT Server timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;
        default: break;
    }
}

