particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
typedef struct {
    BleObject::GattClient* instance;
} GattClientImpl;
static GattClientImpl gattcImpl;

BleObject::GattClient::GattClient(BleObject* obj) : bleObj_(obj) {
    readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
    readBuf_ = nullptr;
    readLen_ = 0;
    readWriteSemaphore_ = nullptr;
    attMtuExchangeTimer_ = nullptr;
    resetDiscoveryState();
}

int BleObject::GattClient::init(void) {
    gattcDiscSvcCharPool_.init(GATT_CLIENT_DISC_SVC_CHAR_POOL_SIZE); // Just a guess
    gattcDataRecPool_.init(GATT_CLIENT_DATA_REC_POOL_SIZE);
    if (os_timer_create(&attMtuExchangeTimer_, BLE_ATT_MTU_EXCHANGE_DELAY_MS, onAttMtuExchangeTimerExpired, this, true, nullptr)) {
        LOG(ERROR, "os_timer_create() failed.");
        return SYSTEM_ERROR_INTERNAL;
    }
    gattcImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattClient, 1, processGattClientEvents, &gattcImpl);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::GattClient::discovering(void) const {
    return isDiscovering_;
}

int BleObject::GattClient::discoverServices(uint16_t connHandle, const hal_ble_uuid_t* uuid, on_ble_disc_service_cb_t callback, void* context) {
    int ret = bleObj_->connectionsMgr->valid(connHandle);
    CHECK_RETURN(ret, nullptr);
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = BLE_DISCOVERY_PROCEDURE_SERVICES;
    if (uuid == nullptr) {
        discoverAll_ = true;
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, nullptr);
    } else {
        ble_uuid_t svcUUID;
        BleObject::toPlatformUUID(uuid, &svcUUID);
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, &svcUUID);
    }
    if (ret != NRF_SUCCESS) {
        resetDiscoveryState();
        os_semaphore_destroy(discoverySemaphore_);
        NRF_CHECK_RETURN(ret, "sd_ble_gattc_primary_services_discover");
    }
    isDiscovering_ = true;
    ret = SYSTEM_ERROR_NONE;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        ret = SYSTEM_ERROR_TIMEOUT;
    }
    os_semaphore_destroy(discoverySemaphore_);
    hal_ble_svc_t* services = (hal_ble_svc_t*)gattcDiscSvcCharPool_.alloc(discoveredServices_.size() * sizeof(hal_ble_svc_t));
    LOG_DEBUG(TRACE, "Discovered services address: %u, len: %u", (unsigned)services, discoveredServices_.size() * sizeof(hal_ble_svc_t));
    if (services) {
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_SVC_DISCOVERED;
        msg.evt.params.svc_disc.version = 0x01;
        msg.evt.params.svc_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.svc_disc.count = discoveredServices_.size();
        for (int i = 0; i < discoveredServices_.size(); i++) {
            const hal_ble_svc_t& service = discoveredServices_[i];
            memcpy(services + i, &service, sizeof(hal_ble_svc_t));
        }
        msg.evt.params.svc_disc.services = services;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        bleObj_->dispatcher->enqueue(msg);
    }
    resetDiscoveryState();
    return ret;
}

int BleObject::GattClient::discoverCharacteristics(uint16_t connHandle, const hal_ble_svc_t* service, on_ble_disc_char_cb_t callback, void* context) {
    int ret = bleObj_->connectionsMgr->valid(connHandle);
    CHECK_RETURN(ret, nullptr);
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    ble_gattc_handle_range_t handleRange;
    handleRange.start_handle = service->start_handle;
    handleRange.end_handle = service->end_handle;
    currDiscConnHandle_ = connHandle;
    currDiscSvc_ = *service;
    currDiscProcedure_ = BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    if (sd_ble_gattc_characteristics_discover(connHandle, &handleRange) != NRF_SUCCESS) {
        resetDiscoveryState();
        os_semaphore_destroy(discoverySemaphore_);
        NRF_CHECK_RETURN(ret, "sd_ble_gattc_characteristics_discover");
    }
    isDiscovering_ = true;
    ret = SYSTEM_ERROR_NONE;
    os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false);
    // Now discover characteristic descriptors
    currDiscProcedure_ = BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) != NRF_SUCCESS) {
        os_semaphore_destroy(discoverySemaphore_);
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
    } else {
        ret = SYSTEM_ERROR_NONE;
        if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
            ret = SYSTEM_ERROR_TIMEOUT;
        }
    }
    os_semaphore_destroy(discoverySemaphore_);
    hal_ble_char_t* characteristics = (hal_ble_char_t*)gattcDiscSvcCharPool_.alloc(discoveredCharacteristics_.size() * sizeof(hal_ble_char_t));
    LOG_DEBUG(TRACE, "Discovered characteristics address: %u, len: %u", (unsigned)characteristics, discoveredCharacteristics_.size() * sizeof(hal_ble_char_t));
    if (characteristics) {
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_CHAR_DISCOVERED;
        msg.evt.params.char_disc.version = 0x01;
        msg.evt.params.char_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.char_disc.count = discoveredCharacteristics_.size();
        for (int i = 0; i < discoveredCharacteristics_.size(); i++) {
            const hal_ble_char_t& characteristic = discoveredCharacteristics_[i];
            memcpy(characteristics + i, &characteristic, sizeof(hal_ble_char_t));
        }
        msg.evt.params.char_disc.characteristics = characteristics;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        bleObj_->dispatcher->enqueue(msg);
    }
    resetDiscoveryState();
    return ret;
}

