particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::GattClient::setDesiredAttMtu(uint16_t attMtu) {
    desiredAttMtu_ = MIN(attMtu, BLE_MAX_ATT_MTU_SIZE);
    return SYSTEM_ERROR_NONE;
}

size_t BleObject::GattClient::writeAttribute(uint16_t connHandle, uint16_t attrHandle, const uint8_t* buf, size_t len, bool response) {
    if (buf == nullptr) {
        return 0;
    }
    int ret = bleObj_->connectionsMgr->valid(connHandle);
    CHECK_RETURN(ret, nullptr);
    ble_gattc_write_params_t writeParams;
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    } else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    len = MIN(len, BLE_ATTR_VALUE_PACKET_SIZE(getAttMtu(connHandle)));
    writeParams.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle = attrHandle;
    writeParams.offset = 0;
    writeParams.len = len;
    writeParams.p_value = buf;
    if (sd_ble_gattc_write(connHandle, &writeParams) != NRF_SUCCESS) {
        os_semaphore_destroy(readWriteSemaphore_);
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        return 0;
    }
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        len = 0;
    }
    os_semaphore_destroy(readWriteSemaphore_);
    return len;
}

// FIXME: Multi-link read
size_t BleObject::GattClient::readAttribute(uint16_t connHandle, uint16_t attrHandle, uint8_t* buf, size_t len) {
    if (buf == nullptr) {
        return 0;
    }
    int ret = bleObj_->connectionsMgr->valid(connHandle);
    CHECK_RETURN(ret, nullptr);
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    readAttrHandle_ = attrHandle;
    readBuf_ = buf;
    readLen_ = MIN(len, BLE_ATTR_VALUE_PACKET_SIZE(getAttMtu(connHandle)));
    ret = sd_ble_gattc_read(connHandle, attrHandle, 0);
    if (ret != NRF_SUCCESS) {
        readBuf_ = nullptr;
        readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
        LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
        os_semaphore_destroy(readWriteSemaphore_);
        return 0;
    }
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        return 0;
    }
    os_semaphore_destroy(readWriteSemaphore_);
    return readLen_;
}

void BleObject::GattClient::resetDiscoveryState(void) {
    discoverAll_ = false;
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    attMtuExchangeConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscProcedure_ = BLE_DISCOVERY_PROCEDURE_IDLE;
    discoveredServices_.clear();
    discoveredCharacteristics_.clear();
    discoverySemaphore_ = nullptr;
}

bool BleObject::GattClient::readServiceUUID128IfNeeded(void) {
    for (int i = 0;  i < discoveredServices_.size(); i++) {
        hal_ble_svc_t& service = discoveredServices_[i];
        if (service.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, service.start_handle, 0) == NRF_SUCCESS);
        }
    }
    return false;
}

bool BleObject::GattClient::readCharacteristicUUID128IfNeeded(void) {
    for (int i = 0;  i < discoveredCharacteristics_.size(); i++) {
        hal_ble_char_t& characteristic = discoveredCharacteristics_[i];
        if (characteristic.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, characteristic.decl_handle, 0) == NRF_SUCCESS);
        }
    }
    return false;
}

hal_ble_svc_t* BleObject::GattClient::findDiscoveredService(uint16_t handle) {
    for (int i = 0;  i < discoveredServices_.size(); i++) {
        hal_ble_svc_t& service = discoveredServices_[i];
        if (service.start_handle <= handle && handle <= service.end_handle) {
            return &service;
        }
    }
    return nullptr;
}

hal_ble_char_t* BleObject::GattClient::findDiscoveredCharacteristic(uint16_t handle) {
    hal_ble_char_t* foundChar = nullptr;
    for (int i = 0;  i < discoveredCharacteristics_.size(); i++) {
        hal_ble_char_t& characteristic = discoveredCharacteristics_[i];
        if (characteristic.decl_handle <= handle) {
            foundChar = &characteristic;
        }
    }
    return foundChar;
}

void BleObject::GattClient::onAttMtuExchangeTimerExpired(os_timer_t timer) {
    GattClient* gattc;
    os_timer_get_id(timer, (void**)&gattc);
    if (!gattc->attMtuExchanged(gattc->attMtuExchangeConnHandle_)) {
        LOG_DEBUG(TRACE, "Request to change ATT_MTU from %d to %d", BLE_DEFAULT_ATT_MTU_SIZE, gattc->desiredAttMtu_);
        int ret = sd_ble_gattc_exchange_mtu_request(gattc->attMtuExchangeConnHandle_, gattc->desiredAttMtu_);
        NRF_CHECK_RETURN_VOID(ret, "sd_ble_gattc_exchange_mtu_request");
    }
    else {
        LOG_DEBUG(TRACE, "ATT_MTU has been exchanged.");
    }
}

void BleObject::GattClient::gattcEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    GattClient* gattc = static_cast<GattClient*>(context);
    if (gattc && event) {
        if (event->type == BLE_EVT_SVC_DISCOVERED) {
            if (event->params.svc_disc.services != nullptr) {
                gattc->gattcDiscSvcCharPool_.free(event->params.svc_disc.services);
                LOG_DEBUG(TRACE, "Free discovered services memory: %u", (unsigned)event->params.svc_disc.services);
            }
        } else if (event->type == BLE_EVT_CHAR_DISCOVERED) {
            if (event->params.char_disc.characteristics != nullptr) {
                gattc->gattcDiscSvcCharPool_.free(event->params.char_disc.characteristics);
                LOG_DEBUG(TRACE, "Free discovered characteristics memory: %u", (unsigned)event->params.char_disc.characteristics);
            }
        } else if (event->type == BLE_EVT_DATA_NOTIFIED) {
            if (event->params.data_rec.data != nullptr) {
                gattc->gattcDataRecPool_.free(event->params.data_rec.data);
                LOG_DEBUG(TRACE, "Free received data memory: %u", (unsigned)event->params.data_rec.data);
            }
        }
    }
}

void BleObject::GattClient::processGattClientEvents(const ble_evt_t* event, void* context) {
    GattClient* gattc = static_cast<GattClientImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            // Use the default ATT_MTU on connected.
            // FIXME: What if there is a new connection established before the timer expired?
            gattc->configureAttMtu(event->evt.gap_evt.conn_handle, BLE_DEFAULT_ATT_MTU_SIZE);
            if (gattc->desiredAttMtu_ > BLE_DEFAULT_ATT_MTU_SIZE) {
                if (!os_timer_change(gattc->attMtuExchangeTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                    LOG_DEBUG(TRACE, "Attempts to exchange ATT_MTU if needed.");
                    gattc->attMtuExchangeConnHandle_ = event->evt.gap_evt.conn_handle;
                }
            }
        } break;
        case BLE_GAP_EVT_DISCONNECTED: {
            if (!os_timer_is_active(gattc->attMtuExchangeTimer_, nullptr)) {
                os_timer_change(gattc->attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
            }
            gattc->clearAttMtu(event->evt.gap_evt.conn_handle);
            if (gattc->isDiscovering_ && event->evt.gap_evt.conn_handle == gattc->currDiscConnHandle_) {
                os_semaphore_destroy(gattc->discoverySemaphore_);
                gattc->resetDiscoveryState();
            }
        } break;
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            const ble_gattc_evt_exchange_mtu_rsp_t& attMtuRsp = event->evt.gattc_evt.params.exchange_mtu_rsp;
            uint16_t effectAttMtu = MIN(attMtuRsp.server_rx_mtu, gattc->desiredAttMtu_);
            effectAttMtu = MAX(effectAttMtu, BLE_MIN_ATT_MTU_SIZE);
            gattc->configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu, true);
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response: %d, effective: %d", attMtuRsp.server_rx_mtu, effectAttMtu);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.evt.params.gatt_params_updated.version = 0x01;
            msg.evt.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.evt.params.gatt_params_updated.att_mtu_size = effectAttMtu;
            gattc->bleObj_->dispatcher->enqueue(msg);
        } break;
        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
            const ble_gattc_evt_prim_srvc_disc_rsp_t& primSvcDiscRsp = event->evt.gattc_evt.params.prim_srvc_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d primary service discovered.", primSvcDiscRsp.count);
            if (gattc->isDiscovering_ && gattc->currDiscProcedure_ == BLE_DISCOVERY_PROCEDURE_SERVICES &&
                    event->evt.gattc_evt.conn_handle == gattc->currDiscConnHandle_) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    for (uint8_t i = 0; i < primSvcDiscRsp.count; i++) {
                        hal_ble_svc_t service;
                        service.start_handle = primSvcDiscRsp.services[i].handle_range.start_handle;
                        service.end_handle = primSvcDiscRsp.services[i].handle_range.end_handle;
                        BleObject::toHalUUID(&primSvcDiscRsp.services[i].uuid, &service.uuid);
                        gattc->discoveredServices_.append(service);
                    }
                    uint16_t currEndHandle = primSvcDiscRsp.services[primSvcDiscRsp.count - 1].handle_range.end_handle;
                    if ((gattc->discoverAll_) && (currEndHandle < SERVICES_TOP_END_HANDLE)) {
                        int ret = sd_ble_gattc_primary_services_discover(gattc->currDiscConnHandle_, currEndHandle + 1, nullptr);
                        if (ret == NRF_SUCCESS) {
                            return;
                        }
                        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
                    }
                } else {
                    LOG(ERROR, "BLE service discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                }
                if (gattc->readServiceUUID128IfNeeded()) {
                    return;
                }
                os_semaphore_give(gattc->discoverySemaphore_, false);
            }
        } break;
        case BLE_GATTC_EVT_CHAR_DISC_RSP: {
            const ble_gattc_evt_char_disc_rsp_t& charDiscRsp = event->evt.gattc_evt.params.char_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d characteristic discovered.", charDiscRsp.count);
            if (gattc->isDiscovering_ && gattc->currDiscProcedure_ == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS &&
                    event->evt.gattc_evt.conn_handle == gattc->currDiscConnHandle_) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    for (uint8_t i = 0; i < charDiscRsp.count; i++) {
                        hal_ble_char_t characteristic;
                        characteristic.char_ext_props = charDiscRsp.chars[i].char_ext_props;
                        characteristic.properties = toHalCharProps(charDiscRsp.chars[i].char_props);
                        characteristic.decl_handle = charDiscRsp.chars[i].handle_decl;
                        characteristic.value_handle = charDiscRsp.chars[i].handle_value;
                        BleObject::toHalUUID(&charDiscRsp.chars[i].uuid, &characteristic.uuid);
                        gattc->discoveredCharacteristics_.append(characteristic);
                    }
                    uint16_t currEndHandle = charDiscRsp.chars[charDiscRsp.count - 1].handle_value;
                    if (currEndHandle < gattc->currDiscSvc_.end_handle) {
                        ble_gattc_handle_range_t handleRange;
                        handleRange.start_handle = currEndHandle + 1;
                        handleRange.end_handle = gattc->currDiscSvc_.end_handle;
                        int ret = sd_ble_gattc_characteristics_discover(gattc->currDiscConnHandle_, &handleRange);
                        if (ret == NRF_SUCCESS) {
                            return;
                        }
                        LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
                    }
                } else {
                    LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                }
                if (gattc->readCharacteristicUUID128IfNeeded()) {
                    return;
                }
                os_semaphore_give(gattc->discoverySemaphore_, false);
            }
        } break;
        case BLE_GATTC_EVT_DESC_DISC_RSP: {
            const ble_gattc_evt_desc_disc_rsp_t& descDiscRsp = event->evt.gattc_evt.params.desc_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d descriptors discovered.", descDiscRsp.count);
            if (gattc->isDiscovering_ && gattc->currDiscProcedure_ == BLE_DISCOVERY_PROCEDURE_DESCRIPTORS &&
                    event->evt.gattc_evt.conn_handle == gattc->currDiscConnHandle_) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    for (uint8_t i = 0; i < descDiscRsp.count; i++) {
                        // It will report all attributes with 16-bits UUID, filter descriptors.
                        hal_ble_char_t* characteristic = gattc->findDiscoveredCharacteristic(descDiscRsp.descs[i].handle);
                        if (characteristic) {
                            switch (descDiscRsp.descs[i].uuid.uuid) {
                                case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC: {
                                    characteristic->user_desc_handle = descDiscRsp.descs[i].handle;
                                } break;
                                case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC: {
                                    characteristic->cccd_handle = descDiscRsp.descs[i].handle;
                                } break;
                                case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC: {
                                    characteristic->sccd_handle = descDiscRsp.descs[i].handle;
                                } break;
                                case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                                case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                                case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT:
                                default: break;
                            }
                        }
                    }
                    uint16_t currEndHandle = descDiscRsp.descs[descDiscRsp.count - 1].handle;
                    if (currEndHandle < gattc->currDiscSvc_.end_handle) {
                        ble_gattc_handle_range_t handleRange;
                        handleRange.start_handle = currEndHandle + 1;
                        handleRange.end_handle = gattc->currDiscSvc_.end_handle;
                        int ret = sd_ble_gattc_descriptors_discover(gattc->currDiscConnHandle_, &handleRange);
                        if (ret == NRF_SUCCESS) {
                            return;
                        }
                        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
                    }
                }
                os_semaphore_give(gattc->discoverySemaphore_, false);
            }
        } break;
        case BLE_GATTC_EVT_READ_RSP: {
            const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");
            if (gattc->isDiscovering_ && event->evt.gattc_evt.conn_handle == gattc->currDiscConnHandle_) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    if (gattc->currDiscProcedure_ == BLE_DISCOVERY_PROCEDURE_SERVICES) {
                        hal_ble_svc_t* service = gattc->findDiscoveredService(readRsp.handle);
                        if (service) {
                            service->uuid.type = BLE_UUID_TYPE_128BIT;
                            memcpy(service->uuid.uuid128, readRsp.data, BLE_SIG_UUID_128BIT_LEN);
                            if (gattc->readServiceUUID128IfNeeded()) {
                                return;
                            }
                        }
                    } else if (gattc->currDiscProcedure_ == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
                        hal_ble_char_t* characteristic = gattc->findDiscoveredCharacteristic(readRsp.handle);
                        if (characteristic) {
                            characteristic->uuid.type = BLE_UUID_TYPE_128BIT;
                            memcpy(characteristic->uuid.uuid128, &readRsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                            if (gattc->readCharacteristicUUID128IfNeeded()) {
                                return;
                            }
                        }
                    }
                } else {
                    LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                }
                os_semaphore_give(gattc->discoverySemaphore_, false);
            } else if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                if (gattc->readAttrHandle_ == readRsp.handle && gattc->readBuf_ != nullptr) {
                    gattc->readLen_ = MIN(gattc->readLen_, readRsp.len);
                    memcpy(gattc->readBuf_, readRsp.data, gattc->readLen_);
                }
                os_semaphore_give(gattc->readWriteSemaphore_, false);
            } else {
                LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }
        } break;
        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
            os_semaphore_give(gattc->readWriteSemaphore_, false);
        } break;
        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
            os_semaphore_give(gattc->readWriteSemaphore_, false);
        } break;
        case BLE_GATTC_EVT_HVX: {
            const ble_gattc_evt_hvx_t& hvx = event->evt.gattc_evt.params.hvx;
            LOG_DEBUG(TRACE, "BLE GATT Client event: data received. conn_handle: %d, attr_handle: %d, type: %d",
                    event->evt.gattc_evt.conn_handle, hvx.handle, hvx.type);
            if (hvx.type == BLE_GATT_HVX_INDICATION) {
                int ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, hvx.handle);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
                }
            }
            uint8_t* data = (uint8_t*)gattc->gattcDataRecPool_.alloc(hvx.len);
            LOG_DEBUG(TRACE, "Received data address: %u, len: %u", (unsigned)data, hvx.len);
            if (data) {
                BleObject::BleEventDispatcher::EventMessage msg;
                msg.evt.type = BLE_EVT_DATA_NOTIFIED;
                msg.evt.params.data_rec.version = 0x01;
                msg.evt.params.data_rec.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.evt.params.data_rec.attr_handle = hvx.handle;
                msg.evt.params.data_rec.offset = 0;
                msg.evt.params.data_rec.data_len = hvx.len;
                memcpy(data, hvx.data, hvx.len);
                msg.evt.params.data_rec.data = data;
                msg.hook = gattc->gattcEventProcessedHook;
                msg.hookContext = gattc;
                gattc->bleObj_->dispatcher->enqueue(msg);
            }
        } break;
        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);
            // Disconnect on GATT Client timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;
        default: break;
    }
}

bool BleObject::initialized_ = false;

BleObject::BleObject()
    : dispatcher(std::make_unique<BleEventDispatcher>(this)),
      gap(std::make_unique<BleGap>(this)),
      broadcaster(std::make_unique<Broadcaster>(this)),
      observer(std::make_unique<Observer>(this)),
      connectionsMgr(std::make_unique<ConnectionsManager>(this)),
      gatts(std::make_unique<GattServer>(this)),
      gattc(std::make_unique<GattClient>(this)) {
    init();
}

BleObject& BleObject::getInstance(void) {
    static BleObject instance;
    return instance;
}

