particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
size_t ble_gatt_server_set_characteristic_value(uint16_t value_handle, const uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_server_set_characteristic_value().");
    return BleObject::getInstance().gatts->setValue(value_handle, buf, len);
}

size_t ble_gatt_server_get_characteristic_value(uint16_t value_handle, uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_server_get_characteristic_value().");
    return BleObject::getInstance().gatts->getValue(value_handle, buf, len);
}

/**********************************************
 * BLE GATT Client APIs
 */
int ble_gatt_client_discover_all_services(uint16_t conn_handle, on_ble_disc_service_cb_t callback, void* context, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_all_services().");
    return BleObject::getInstance().gattc->discoverServices(conn_handle, nullptr, callback, context);
}

int ble_gatt_client_discover_service_by_uuid(uint16_t conn_handle, const hal_ble_uuid_t* uuid, on_ble_disc_service_cb_t callback, void* context, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_service_by_uuid().");
    return BleObject::getInstance().gattc->discoverServices(conn_handle, uuid, callback, context);
}

int ble_gatt_client_discover_characteristics(uint16_t conn_handle, const hal_ble_svc_t* service, on_ble_disc_char_cb_t callback, void* context, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_characteristics().");
    return BleObject::getInstance().gattc->discoverCharacteristics(conn_handle, service, callback, context);
}

int ble_gatt_client_discover_characteristics_by_uuid(uint16_t conn_handle, const hal_ble_svc_t* service, const hal_ble_uuid_t* uuid, on_ble_disc_char_cb_t callback, void* context, void* reserved) {
    return SYSTEM_ERROR_NOT_SUPPORTED;
}

bool ble_gatt_client_is_discovering(void) {
    return BleObject::getInstance().gattc->discovering();
}

int ble_gatt_client_set_att_mtu(uint16_t att_mtu, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_all_services().");
    return BleObject::getInstance().gattc->setDesiredAttMtu(att_mtu);
}

int ble_gatt_client_configure_cccd(uint16_t conn_handle, uint16_t cccd_handle, uint8_t cccd_value, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_configure_cccd().");
    if (conn_handle == BLE_CONN_HANDLE_INVALID || cccd_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (cccd_value > BLE_SIG_CCCD_VAL_INDICATION) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    uint8_t buf[2] = {0x00, 0x00};
    buf[0] = cccd_value;
    if (BleObject::getInstance().gattc->writeAttribute(conn_handle, cccd_handle, buf, 2, true) == 0) {
        return SYSTEM_ERROR_INTERNAL;
    }
    return SYSTEM_ERROR_NONE;
}

size_t ble_gatt_client_write_with_response(uint16_t conn_handle, uint16_t value_handle, const uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_write_with_response().");
    return BleObject::getInstance().gattc->writeAttribute(conn_handle, value_handle, buf, len, true);
}

size_t ble_gatt_client_write_without_response(uint16_t conn_handle, uint16_t value_handle, const uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_write_without_response().");
    return BleObject::getInstance().gattc->writeAttribute(conn_handle, value_handle, buf, len, false);
}

size_t ble_gatt_client_read(uint16_t conn_handle, uint16_t value_handle, uint8_t* buf, size_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    LOG_DEBUG(TRACE, "ble_gatt_client_read().");
    return BleObject::getInstance().gattc->readAttribute(conn_handle, value_handle, buf, len);
}

#endif // HAL_PLATFORM_BLE
